# 1. Basic

In [2]:
import pandas as pd
pd.Series([1,2,31,12,3,4])

0     1
1     2
2    31
3    12
4     3
5     4
dtype: int64

In [3]:
t = pd.Series([1,2,31,12,3,4])
type(t)

pandas.core.series.Series

In [4]:
t

0     1
1     2
2    31
3    12
4     3
5     4
dtype: int64

In [5]:
t2 = pd.Series([1,23,2,2,1], index=list("abcde"))
t2

a     1
b    23
c     2
d     2
e     1
dtype: int64

In [6]:
temp_dict = {"name":"Jay","age":"30","tel":"10086"}
t3 = pd.Series(temp_dict)
t3

name      Jay
age        30
tel     10086
dtype: object

In [8]:
t3.dtype # O means object

dtype('O')

In [10]:
import string
a = {string.ascii_uppercase[i]: i for i in range(10)}
a

{'A': 0,
 'B': 1,
 'C': 2,
 'D': 3,
 'E': 4,
 'F': 5,
 'G': 6,
 'H': 7,
 'I': 8,
 'J': 9}

In [11]:
pd.Series(a)

A    0
B    1
C    2
D    3
E    4
F    5
G    6
H    7
I    8
J    9
dtype: int64

In [12]:
pd.Series(a, index=list(string.ascii_uppercase[5:15]))

F    5.0
G    6.0
H    7.0
I    8.0
J    9.0
K    NaN
L    NaN
M    NaN
N    NaN
O    NaN
dtype: float64

In [13]:
t3

name      Jay
age        30
tel     10086
dtype: object

In [14]:
t3["age"]

'30'

In [15]:
t3[1]

'30'

In [17]:
t3[:3]

name      Jay
age        30
tel     10086
dtype: object

In [18]:
t3[[1,2]]

age       30
tel    10086
dtype: object

In [19]:
t3[["age","tel"]]

age       30
tel    10086
dtype: object

In [20]:
t

0     1
1     2
2    31
3    12
4     3
5     4
dtype: int64

In [21]:
t[t>10]

2    31
3    12
dtype: int64

In [24]:
t3.index

Index(['name', 'age', 'tel'], dtype='object')

In [29]:
for i in t3.index:
    print(i)
print(type(t3.index))
print(len(t3.index))

name
age
tel
<class 'pandas.core.indexes.base.Index'>
3

In [30]:
list(t3.index)

['name', 'age', 'tel']

In [31]:
list(t3.index)[:2]

['name', 'age']

In [27]:
t3.values

array(['Jay', '30', '10086'], dtype=object)

In [32]:
type(t3.values)

numpy.ndarray

# 2. File

In [34]:
import pandas as pd
df = pd.read_csv(r".\data\dogNames2.csv")
df.head(10)

  Row_Labels  Count_AnimalName
0          1                 1
1          2                 2
2      40804                 1
3      90201                 1
4      90203                 1
5     102201                 1
6    3010271                 1
7      MARCH                 2
8      APRIL                51
9     AUGUST                14

# 3. DataFrame

In [36]:
import pandas as pd
import numpy as np
pd.DataFrame(np.arange(12).reshape(3,4))

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [39]:
pd.DataFrame(np.arange(12).reshape(3,4), index=list("abc"), columns=list("WXYZ"))

   W  X   Y   Z
a  0  1   2   3
b  4  5   6   7
c  8  9  10  11

In [40]:
d1 = {"name":["Jay","Roger"],"age":[20,30],"tel":[10086,10010]}
pd.DataFrame(d1)

    name  age    tel
0    Jay   20  10086
1  Roger   30  10010

In [42]:
t1 = pd.DataFrame(d1)
type(t1)

pandas.core.frame.DataFrame

In [45]:
d2 = [{"name":"Jay1","age":10,"tel":10000},{"name":"Jay2","age":20,"tel":20000},{"name":"Jay3","age":30}]
d2

[{'name': 'Jay1', 'age': 10, 'tel': 10000},
 {'name': 'Jay2', 'age': 20, 'tel': 20000},
 {'name': 'Jay3', 'age': 30}]

In [46]:
t2 = pd.DataFrame(d2)
t2

   name  age      tel
0  Jay1   10  10000.0
1  Jay2   20  20000.0
2  Jay3   30      NaN

In [47]:
t2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   age     3 non-null      int64
 2   tel     2 non-null      float64
dtypes: float64(1), int64(1), object(1)
memory usage: 200.0+ bytes

In [48]:
t2.describe()

        age           tel
count   3.0      2.000000
mean   20.0  15000.000000
std    10.0   7071.067812
min    10.0  10000.000000
25%    15.0  12500.000000
50%    20.0  15000.000000
75%    25.0  17500.000000
max    30.0  20000.000000

In [49]:
import pandas as pd
df = pd.read_csv(r".\data\dogNames2.csv")
df.head(10)

  Row_Labels  Count_AnimalName
0          1                 1
1          2                 2
2      40804                 1
3      90201                 1
4      90203                 1
5     102201                 1
6    3010271                 1
7      MARCH                 2
8      APRIL                51
9     AUGUST                14

In [61]:
df = df.sort_values(by="Count_AnimalName", ascending=False)
#print(df.head(5))
#print(df[:20])
#print(df["Row_Labels"])
print(df[:20]["Row_Labels"])

1156        BELLA
9140          MAX
2660      CHARLIE
3251         COCO
12368       ROCKY
8417         LOLA
8552        LUCKY
8560         LUCY
2032        BUDDY
3641        DAISY
11703    PRINCESS
829        BAILEY
9766        MOLLY
14466       TEDDY
2913        CHLOE
14779        TOBY
8620         LUNA
6515         JACK
8788       MAGGIE
10750        OREO
Name: Row_Labels, dtype: object

In [62]:
print(type(df["Row_Labels"]))

<class 'pandas.core.series.Series'>

In [63]:
t3 = pd.DataFrame(np.arange(12).reshape(3,4), index=list("abc"), columns=list("WXYZ"))
t3

   W  X   Y   Z
a  0  1   2   3
b  4  5   6   7
c  8  9  10  11

In [64]:
t3.loc["a","Z"]

3

In [65]:
t3.loc["a",:]

W    0
X    1
Y    2
Z    3
Name: a, dtype: int32

In [66]:
t3.loc[:, "Y"]

a     2
b     6
c    10
Name: Y, dtype: int32

In [67]:
t3.loc[["a","c"], :]

   W  X   Y   Z
a  0  1   2   3
c  8  9  10  11

In [69]:
t3.loc[:, ["W","Z"]]

   W   Z
a  0   3
b  4   7
c  8  11

In [70]:
t3.loc[["a","b"], ["W","Z"]]

   W  Z
a  0  3
b  4  7

In [71]:
t3

   W  X   Y   Z
a  0  1   2   3
b  4  5   6   7
c  8  9  10  11

In [72]:
t3.iloc[1]

W    4
X    5
Y    6
Z    7
Name: b, dtype: int32

In [73]:
t3.iloc[1, :]

W    4
X    5
Y    6
Z    7
Name: b, dtype: int32

In [74]:
t3.iloc[:, 2]

a     2
b     6
c    10
Name: Y, dtype: int32

In [75]:
t3.iloc[:, [2,1]]

    Y  X
a   2  1
b   6  5
c  10  9

In [77]:
t3.iloc[[0,2], [2,1]]

    Y  X
a   2  1
c  10  9

In [78]:
t3.iloc[1:, :2]

   W  X
b  4  5
c  8  9

In [79]:
t3.iloc[1:, :2] = 30
t3

    W   X   Y   Z
a   0   1   2   3
b  30  30   6   7
c  30  30  10  11

In [80]:
t3.iloc[1:, :2] = np.nan
t3

     W    X   Y   Z
a  0.0  1.0   2   3
b  NaN  NaN   6   7
c  NaN  NaN  10  11

In [82]:
df[df["Count_AnimalName"]>800]

      Row_Labels  Count_AnimalName
1156       BELLA              1195
9140         MAX              1153
2660     CHARLIE               856
3251        COCO               852
12368      ROCKY               823

In [83]:
df[(df["Count_AnimalName"]>800)&(df["Count_AnimalName"]<1000)]

      Row_Labels  Count_AnimalName
2660     CHARLIE               856
3251        COCO               852
12368      ROCKY               823

In [84]:
df[(df["Count_AnimalName"]>700)&(df["Row_Labels"].str.len()>4)]

      Row_Labels  Count_AnimalName
1156       BELLA              1195
2660     CHARLIE               856
12368      ROCKY               823
8552       LUCKY               723

In [85]:
pd.isnull(t3)

       W      X      Y      Z
a  False  False  False  False
b   True   True  False  False
c   True   True  False  False

In [86]:
pd.notnull(t3)

       W      X     Y     Z
a   True   True  True  True
b  False  False  True  True
c  False  False  True  True

In [87]:
t3[pd.notnull(t3["W"])]

     W    X  Y  Z
a  0.0  1.0  2  3

In [88]:
t3.dropna(axis=0)

     W    X  Y  Z
a  0.0  1.0  2  3

In [89]:
t3.dropna(axis=0, how="all")

     W    X   Y   Z
a  0.0  1.0   2   3
b  NaN  NaN   6   7
c  NaN  NaN  10  11

In [90]:
t3.dropna(axis=0, how="any")

     W    X  Y  Z
a  0.0  1.0  2  3

In [91]:
t3

     W    X   Y   Z
a  0.0  1.0   2   3
b  NaN  NaN   6   7
c  NaN  NaN  10  11

In [94]:
t3.dropna(axis=0, how="any", inplace=True)
t3

     W    X  Y  Z
a  0.0  1.0  2  3

In [95]:
t2

   name  age      tel
0  Jay1   10  10000.0
1  Jay2   20  20000.0
2  Jay3   30      NaN

In [99]:
t2.fillna(100)

   name  age      tel
0  Jay1   10  10000.0
1  Jay2   20  20000.0
2  Jay3   30    100.0

In [100]:
t2

   name  age      tel
0  Jay1   10  10000.0
1  Jay2   20  20000.0
2  Jay3   30      NaN

In [102]:
t2.fillna(t2.mean())

   name  age      tel
0  Jay1   10  10000.0
1  Jay2   20  20000.0
2  Jay3   30  15000.0

In [103]:
t2["age"].fillna(t2["age"].mean())

0    10
1    20
2    30
Name: age, dtype: int64

In [105]:
t2["age"]=t2["age"].fillna(t2["age"].mean())
t2

   name  age      tel
0  Jay1   10  10000.0
1  Jay2   20  20000.0
2  Jay3   30      NaN

In [106]:
t2["age"][1]=np.nan

<ipython-input-106-f45e7937aba7>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  t2["age"][1]=np.nan
C:\Users\v0cn140\Anaconda3\lib\site-packages\pandas\core\indexing.py:671: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_with_indexer(indexer, value)

In [107]:
t2

   name   age      tel
0  Jay1  10.0  10000.0
1  Jay2   NaN  20000.0
2  Jay3  30.0      NaN

In [113]:
t2["age"].mean()

20.0

In [114]:
t2["age"][1]=0
t2

<ipython-input-114-8ad505ca8f50>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  t2["age"][1]=0

   name   age      tel
0  Jay1  10.0  10000.0
1  Jay2   0.0  20000.0
2  Jay3  30.0      NaN

In [115]:
t2["age"].mean()

13.333333333333334

In [116]:
t2[t2==0]=np.nan
t2

   name   age      tel
0  Jay1  10.0  10000.0
1  Jay2   NaN  20000.0
2  Jay3  30.0      NaN

In [117]:
t2["age"].mean()

20.0